#+TITLE:  Setting up cromwell / docker / slurm etc on a cluster 
#+AUTHOR: Timo Lassmann
#+EMAIL:  timo.lassmann@telethonkids.org.au
#+DATE:   2018-05-24
#+LATEX_CLASS: report
#+OPTIONS:  toc:nil
#+OPTIONS: H:4
#+LATEX_CMD: xelatex



* Install cromwell, udocker etc... 


#+begin_src bash :dir /ssh:pawsey://data/home/timo/bin
  wget https://github.com/broadinstitute/cromwell/releases/download/54/cromwell-54.jar
#+end_src

#+begin_src bash :dir /ssh:pawsey://data/home/timo/programs
  curl https://raw.githubusercontent.com/indigo-dc/udocker/master/udocker.py > udocker
  chmod u+rx ./udocker
  ./udocker install 
#+end_src
#+RESULTS:
| Info: | setup        | repo:        | /home/ubuntu/.udocker |            |       |
| Info: | udocker      | command      | line                  | interface  | 1.1.4 |
| Info: | searching    | for          | udockertools          | 1.1.4      |       |
| Info: | installing   | udockertools | 1.1.4                 |            |       |
| Info: | installation | of           | udockertools          | successful |       |


IMPORTANT: by default udocker will store images in the user's home directory =~/.udocker/=. To use a different location:

#+begin_src bash :dir /ssh:pawsey://data/home/timo/programs
cp udocker ../bin
#+end_src


#+RESULTS:

** udocker 
#+begin_src bash :dir /ssh:pawsey://data/home/timo/programs
  export UDOCKER_DIR="/data/udocker"
export PATH=/data/home/timo/bin/:$PATH 
#+END_SRC

Test configuration:

#+begin_src bash :dir /ssh:pawsey://data/home/timo/
  export UDOCKER_DIR="/data/udocker"
  export PATH=/data/home/timo/bin/:$PATH
  udocker pull debian
  udocker create --name=debtest debian
  udocker run debtest cat /etc/*-release
#+end_src

#+begin_src bash :dir /ssh:pawsey://data/home/timo/ :results both
  export UDOCKER_DIR="/data/udocker"
  export PATH=/data/home/timo/bin/:$PATH
  udocker run debtest cat /etc/os-release
#+end_src

#+RESULTS:
| PRETTY_NAME="Debian             | GNU/Linux  | 10 | (buster)" |
| NAME="Debian                   | GNU/Linux" |    |           |
| 10                             |            |    |           |
| VERSION="10                    | (buster)"  |    |           |
| VERSION_CODENAME=buster         |            |    |           |
| ID=debian                      |            |    |           |
| https://www.debian.org/        |            |    |           |
| https://www.debian.org/support |            |    |           |
| https://bugs.debian.org/       |            |    |           |

Ok this seems to work.

Need to set this up so all users use the same udocker config and have udocker look for containers in =/data/udocker/=.


